TED-Ed/2014-02-12 The history of marriage.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-09 Thu 23:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgaf92c5a" class="outline-2">
<h2 id="orgaf92c5a">2014-02-12 The history of marriage</h2>
<div class="outline-text-2" id="text-orgaf92c5a">
<p class="verse">
There have been many different things written and said about marriage.<br />
From the sweetly inspirational to the hilariously cynical.<br />
But what many of them have in common<br />
&#xa0;is that they sound like they express a universal and timeless truth,<br />
&#xa0;when in fact nearly everything about marriage,<br />
&#xa0;&#xa0;from its main purpose<br />
&#xa0;&#xa0;&#xa0;to the kinds of relationships it covers<br />
&#xa0;&#xa0;&#xa0;to the rights and responsibilities involved,<br />
&#xa0;&#xa0;has varied greatly between different eras, cultures and social classes.<br />
So, let's take a quick look at the evolution of marriage.<br />
<br />
Pair bonding and raising children is as old as humanity itself.<br />
With the rise of sedentary agricultural societies about 10,000 years ago,<br />
&#xa0;marriage was also a way of securing rights to land and property<br />
&#xa0;&#xa0;by designating children born under certain circumstances as rightful heirs.<br />
As these societies became larger and more complex,<br />
&#xa0;marriage became not just a matter between individuals and families,<br />
&#xa0;&#xa0;but also an official institution governed by religious and civil authorities.<br />
And it was already well established by 2100 B.C.<br />
&#xa0;when the earliest surviving written laws in the Mesopotamian Code of Ur-Nammu<br />
&#xa0;&#xa0;provided many specifics governing marriage,<br />
&#xa0;&#xa0;&#xa0;from punishments for adultery to the legal status of children born to slaves.<br />
<br />
Many ancient civilizations allowed some form of multiple simultaneous marriage.<br />
And even today, less than a quarter of the world's hundreds of different cultures prohibit it.<br />
But just because something was allowed doesn't mean it was always possible.<br />
Demographic realities, as well as the link between marriage and wealth, meant that<br />
&#xa0;even though rulers and elites in Ancient Mesopotamia, Egypt and Israel<br />
&#xa0;&#xa0;had multiple concubines or wives,<br />
&#xa0;most commoners could only afford one or two tending towards monogamy in practice.<br />
In other places, the tables were turned,<br />
&#xa0;and a woman could have multiple husbands as in the Himalayan Mountains<br />
&#xa0;&#xa0;where all brothers in a family marrying the same woman<br />
&#xa0;&#xa0;&#xa0;kept the small amount of fertile land from being constantly divided into new households.<br />
<br />
Marriages could vary not only in the number of people they involved<br />
&#xa0;but the types of people as well.<br />
Although the names and laws for such arrangements may have differed,<br />
&#xa0;publicly recognized same-sex unions have popped up in various civilizations throughout history.<br />
Mesopotamian prayers included blessings for such couples,<br />
&#xa0;while Native American Two-Spirit individuals had relationships with both sexes.<br />
The first instances of such arrangements actually being called 'Marriage' come from Rome,<br />
&#xa0;where the Emperors Nero and Elagabalus both married men in public ceremonies<br />
&#xa0;&#xa0;with the practice being explicitly banned in 342 A.D.<br />
But similar traditions survived well into the Christian era,<br />
&#xa0;such as Adelphopoiesis,<br />
&#xa0;&#xa0;or "brother-making" in Orthodox churches,<br />
&#xa0;&#xa0;and even an actual marriage between two men recorded in 1061 at a small chapel in Spain.<br />
Nor was marriage even necessarily between two living people.<br />
Ghost marriages, where either the bride or groom were deceased,<br />
&#xa0;were conducted in China to continue family lineages or appease restless spirits.<br />
And some tribes in Sudan maintain similar practices.<br />
<br />
Despite all these differences, a lot of marriages throughout history did have one thing in common.<br />
With crucial matters like property and reproduction at stake,<br />
&#xa0;they were way too important to depend on young love.<br />
Especially among the upperclasses, matches were often made by families or rulers.<br />
But even for commoners, who had some degree of choice, the main concern was practicality.<br />
The modern idea of marriage as being mainly about love and companionship<br />
&#xa0;only emerged in the last couple of centuries.<br />
With industrialization, urbanization and the growth of the middle class<br />
&#xa0;more people became independent from large extended families<br />
&#xa0;&#xa0;and were able to support a new household on their own.<br />
Encouraged by new ideas from the Enlightenment,<br />
&#xa0;people began to focus on individual happiness and pursuits,<br />
&#xa0;&#xa0;rather than familial duty or wealth and status, at least some of the time.<br />
And this focus on individual happiness soon led to other transformations,<br />
&#xa0;such as easing restrictions on divorce and more people marrying at a later age.<br />
So, as we continue to debate the role and definition of marriage in the modern world,<br />
&#xa0;it might help to keep in mind that marriage has always been shaped by society,<br />
&#xa0;&#xa0;and as a society's structure, values and goals change over time,<br />
&#xa0;&#xa0;&#xa0;its ideas of marriage will continue to change along with them.<br />
</p>
</div>
