English/TED-Ed/2014-02-12 The history of marriage.org
** expression
inspirational [ˌɪnspɪˈreɪʃən(ə)l]: adj. providing encouragement or new ideas for what you should do 给予灵感的
hilarious [hɪˈleriəs] hilariously: adj.adv. extremely funny欢闹的
cynical [ˈsɪnɪk(ə)l]: adj. unwilling to believe that people have good, honest, or sincere reasons for doing something愤世嫉俗的
timeless [ˈtaɪmləs]: adj. literary continuing for ever永恒的
humanity [hjuˈmænəti]: n. people in general人类
sedentary [ˈsed(ə)ntəri]: adj. technical a sedentary group of people tend always to live in the splace不移栖的
agricultural [ˌæɡrɪˈkʌltʃ(ə)rəl]: adj. the practice or science of farming农业的
simultaneous [ˌsaɪm(ə)lˈteɪniəs]: adj. things that are simultaneous happen at exactly the stime同时发生的
institution [ˌɪnstɪˈtuʃ(ə)n]: n. an important system of organization in society that has existed for a long time制度
adultery [əˈdʌltəri]: n. sex between someone who is married and someone who is not their wife or husband通奸
ruler [ˈruːlər]: n. someone such as a king or queen who has official power over a country or area统治者
concubine [ˈkɑŋkjəˌbaɪn]: n. a woman in the past who lived with and had sex with a man who already had a wife or wives, but who was socially less important than the wives 妾
commoner [ˈkɑmənər]: n. someone who is not a member of the ↑nobility平民
monogamy [məˈnɑɡəmi]: n. the custom of being married to only one husband or wife ⇨ bigamy, polygamy一夫一妻制
arrangement [əˈreɪndʒmənt]: n. plans and preparations that you must make so that something can happen安排
prayer [prer]: n. words that you say when praying to God or gods祈祷
adelphopoiesis: n. 兄弟结义
chapel [ˈtʃæp(ə)l]: n. the religious services held in a chapel小礼拜堂, 礼拜
deceased [dɪˈsist]: adj. the deceased someone who has died, especially recently已故的
conduct [ˈkɑnˌdʌkt]: v. to carry out a particular activity or process, especially in order to get information or prove facts 出现
lineage [ˈlɪniɪdʒ]: n. formal the way in which members of a family are ↑descended from other members ⇨ line, ancestry血统
appease [əˈpiz]: v. make someone less angry or stop them from attacking you by giving them what they want安抚
restless [ˈres(t)ləs]: adj. unwilling to keep still or stay where you are, especially because you are nervous or bored SYN fidgety不安宁的
practicality [ˌpræktɪˈkæləti]: n. how suitable something is, or whether it will work实用性
upperclass : n. the upper class the group of people who belong to the highest social class上层
industrialization [ɪnˌdʌstrɪələˈzeɪʃən]: n. when a country or place develops a lot of industry工业化
urbanized [ˈɜrbəˌnaɪzd] urbanization: adj.n. an urbanized country or area has a lot of houses, factories, shops, offices etc都市化
pursuit [pərˈsut]: v. when someone tries to get, achieve, or find something in a determined way ⇨ pursue追求
Pair bonding: 配对
----------------------------------------
what sb.(pl) have in common is that + ...: 某人有的共同的是...
vary greatly between sth.(pl): 在事物中有很大的不同
take a quick look at sth.: express that you quickly glanced at something快速浏览某物
With the rise of sth.: 随着...的兴起
be a way of doing sth.: 某事是做某事的一种方法
secure rights to sth.: 保护有某物的权力
under certain circumstances: 在某些特殊环境下
designate A. as B.: 把A指派为B
a matter between sth.(pl): 关于某事的事情
be governed by: 受……支配/统治
punishments for sth.: 对某事的惩罚
the legal status of sb.: 某人的法律地位/身份
be born to sb.: 为某人所生
a quarter of sth.: 四分之一
the link between sth.(pl): 某事的联系
in practice: 实际上
the tables were turned: 形势逆转了
have relationships with sb.: 与某人有关系
in public ceremonies: 在公共仪式上
at stake: 利害攸关
became independent from sb./sth.: 独立于
be encouraged by: 被...鼓励
focus on A rather than B: 聚集于A而不是B
ease restrictions on sth.: 放松对某事的限制
be shaped by sth.: 受...影响
