English/TED-Ed/2014-02-12 The history of marriage.org
** sentences
what sb.(pl) have in common is that + ...: 
- What atoms have in common is that their qualities are concentrated in their nuclei.
- What those people have in common is that they have arrived at the station to meet the pop singer.
- What we have in common is that Miumiu is bonded to us.
vary greatly between sth.(pl): 在事物中有很大的不同
- These days, marriage varies greatly between different areas in China.
- Decades before, languages in China varied greatly between its towns.
- Needless to say, vampires vary greatly between different cultures.
take a quick look at sth.: express that you quickly glanced at something
- Let's take a quick look at the corporation for which I used to work.
- These students have taken a quick look at the island surrendered to Russia in 1919.
- He takes a quick look at the story to reconstruct how the heroine led a happy life.
With the rise of sth.: 随着...的兴起
- With the rise of losing weight, this special kind of food become popular with young people. 
- With the rise of global warming, the population of penguins is in rapid free fall.
- With the rise of fancy dress parties, she has been fanatical about marking up.
be a way of doing sth.: 某事是做某事的一种方法
- Metro is also a way of going to work in Beijing.
- Before the agreement was reached about the salaries of these busmen,
		bus would not be a way of transport.
- My teacher pointed out that reading books a great deal is also a way of studying English.
secure rights to sth.: 保护有某物的权力
- I was always having difficulty in securing rights to my toys in my youth.
- If you followed in your father's footsteps, you would secure rights to the island.
- The ambassador of China declared that China has secured rights to these islands since 1900.
under certain circumstances: 在某些特殊环境下
- The population of humanity will be in rapid free fall under certain circumstances.
- You were able to mobilize the immune system under certain circumstances.
- The portals embedded into the wall will open automatically under certain circumstances.
designate A. as B.: 把A指派为B
- She must have been designated as the new ambassador in Russia.
- She can't have been designated as the new ambassador in Russia.
- She may have been designated as the new ambassador in Russia.
a matter between sth.(pl): 关于某事的事情
- It's just a matter between you and me.
- It is only within the last century
		that marriage is depicted as a matter between individuals.
- She refused to help me and said that it was only a matter between her mother and me.
be governed by: 受……支配/统治
- What is most remarkable about ancient Greece is that everyone was governed by laws. 
- Governed by the authorities, these poor people couldn't perpetuate their existence.
- People in China used to be governed by these businessmen from America.
punishments for sth.: 对某事的惩罚
- The boy flied apart and it's the punishment for his carelessness.
- He doesn't bond with her daughter anymore, which is the punishment for his divorce.
- These workers lost their heart trapped in the coal mine,
		which must have been the punishment for their carelessness.
the legal status of sb.: 某人的法律地位/身份
- He managed to write an article about the legal status of commoners in these countries.
- We must verify the legal status of those guys who claimed they were police.
- You needn't have verified the legal status of us.
be born to sb.: 为某人所生
- These children born to slaves shouldn't secure the right to the lands.
- The child born to my first wife follows in my footsteps eventually.
- The first child born to me will secure the right to the country.
a quarter of sth.: 四分之一
- A quarter of your lymph nodes may have been destroyed.
- A quarter of the course has already been completed.
- A quarter of his scabs have been wiped away by this doctor.
the link between sth.(pl): 某事的联系
- The link between health and sleep means that we must sleep at least 7 hours a day.
- The link between health and smoking means that I must give up smoking right now.
- The link between health and sports means that I need to exercise every day.
in practice: 实际上
- The chance of hitting the surface of the desk approaches zero in practice.
- I can't speak to a native English speaker in China in practice.
- These parts can't be pieced together in practice.
the tables were turned: 形势逆转了
- He used to quarrel bitterly with his wife, and the tables were turned.
- The tables may have already been turned.
- I bet the tables were turned.
have relationships with sb.: 与某人有关系
- You shouldn't have relationships with two men at the same time.
- She had a relationship with the man who committed a murder.
- She is eager to have relationships with the guy who works for Apple.
in public ceremonies: 在公共仪式上
- Speaking in public ceremonies, I quaked in every limb and my soul
- I focused on dresses in public ceremonies rather than those pretty girls.
- The vicar assembled those parts into a well-organized machine in public ceremonies.
at stake: 利害攸关
- We must pay attention to those facts at stake.
- Marriage is bonded to the wealth of their families at stake.
- Those people at stake will be bunched up together at the meeting.
became independent from sb./sth.: 独立于
- With the team flying apart, those players became independent from this club.
- It doesn't help anyone, since you became independent from our family.
- As you still receive money from your mother, you don't become independent from your family.
be encouraged by: 被...鼓励
- The worker was encouraged by his boss to undertake the task in harsher working conditions.
- Encouraged by his wife, the baker managed to set up a factory.
- While he decided to give up, he was encouraged by those assembly instructions.
focus on A rather than B: 聚集于A而不是B
- We focused on the lymph nodes rather than these scabs.
- He focused on those pretty girls rather than money.
- I focused on these antique shops rather than those street signs.
ease restrictions on sth.: 放松对某事的限制
- It became an accepted fact that the authorities eased restrictions on sex before marriage.
- After easing restrictions on his watching TV, I went to work.
- While easing restrictions on vaccination,
		the authorities established a law prohibiting same-sex marriages.
be shaped by sth.: 受...影响
- The statue must have been shaped by the wind and rain.
- The statue must be shaped by the wind and rain.
- The statue may be shaped by the wind and rain.
