TED-Ed/2014-02-12 The history of marriage.html
<div id="outline-container-org552500c" class="outline-3">
<h3 id="org552500c">sentences</h3>
<div class="outline-text-3" id="text-org552500c">
<p>
what sb.(pl) have in common is that + &#x2026;:<br />
</p>
<ul class="org-ul">
<li>What atoms have in common is that their qualities are concentrated in their nuclei.<br /></li>
<li>What those people have in common is that they have arrived at the station to meet the pop singer.<br /></li>
<li>What we have in common is that Miumiu is bonded to us.<br /></li>
</ul>
<p>
vary greatly between sth.(pl): 在事物中有很大的不同<br />
</p>
<ul class="org-ul">
<li>These days, marriage varies greatly between different areas in China.<br /></li>
<li>Decades before, languages in China varied greatly between its towns.<br /></li>
<li>Needless to say, vampires vary greatly between different cultures.<br /></li>
</ul>
<p>
take a quick look at sth.: express that you quickly glanced at something<br />
</p>
<ul class="org-ul">
<li>Let's take a quick look at the corporation for which I used to work.<br /></li>
<li>These students have taken a quick look at the island surrendered to Russia in 1919.<br /></li>
<li>He takes a quick look at the story to reconstruct how the heroine led a happy life.<br /></li>
</ul>
<p>
With the rise of sth.: 随着&#x2026;的兴起<br />
</p>
<ul class="org-ul">
<li>With the rise of losing weight, this special kind of food become popular with young people.<br /></li>
<li>With the rise of global warming, the population of penguins is in rapid free fall.<br /></li>
<li>With the rise of fancy dress parties, she has been fanatical about marking up.<br /></li>
</ul>
<p>
be a way of doing sth.: 某事是做某事的一种方法<br />
</p>
<ul class="org-ul">
<li>Metro is also a way of going to work in Beijing.<br /></li>
<li>Before the agreement was reached about the salaries of these busmen,<br />
bus would not be a way of transport.<br /></li>
<li>My teacher pointed out that reading books a great deal is also a way of studying English.<br /></li>
</ul>
<p>
secure rights to sth.: 保护有某物的权力<br />
</p>
<ul class="org-ul">
<li>I was always having difficulty in securing rights to my toys in my youth.<br /></li>
<li>If you followed in your father's footsteps, you would secure rights to the island.<br /></li>
<li>The ambassador of China declared that China has secured rights to these islands since 1900.<br /></li>
</ul>
<p>
under certain circumstances: 在某些特殊环境下<br />
</p>
<ul class="org-ul">
<li>The population of humanity will be in rapid free fall under certain circumstances.<br /></li>
<li>You were able to mobilize the immune system under certain circumstances.<br /></li>
<li>The portals embedded into the wall will open automatically under certain circumstances.<br /></li>
</ul>
<p>
designate A. as B.: 把A指派为B<br />
</p>
<ul class="org-ul">
<li>She must have been designated as the new ambassador in Russia.<br /></li>
<li>She can't have been designated as the new ambassador in Russia.<br /></li>
<li>She may have been designated as the new ambassador in Russia.<br /></li>
</ul>
<p>
a matter between sth.(pl): 关于某事的事情<br />
</p>
<ul class="org-ul">
<li>It's just a matter between you and me.<br /></li>
<li>It is only within the last century<br />
that marriage is depicted as a matter between individuals.<br /></li>
<li>She refused to help me and said that it was only a matter between her mother and me.<br /></li>
</ul>
<p>
be governed by: 受……支配/统治<br />
</p>
<ul class="org-ul">
<li>What is most remarkable about ancient Greece is that everyone was governed by laws.<br /></li>
<li>Governed by the authorities, these poor people couldn't perpetuate their existence.<br /></li>
<li>People in China used to be governed by these businessmen from America.<br /></li>
</ul>
<p>
punishments for sth.: 对某事的惩罚<br />
</p>
<ul class="org-ul">
<li>The boy flied apart and it's the punishment for his carelessness.<br /></li>
<li>He doesn't bond with her daughter anymore, which is the punishment for his divorce.<br /></li>
<li>These workers lost their heart trapped in the coal mine,<br />
which must have been the punishment for their carelessness.<br /></li>
</ul>
<p>
the legal status of sb.: 某人的法律地位/身份<br />
</p>
<ul class="org-ul">
<li>He managed to write an article about the legal status of commoners in these countries.<br /></li>
<li>We must verify the legal status of those guys who claimed they were police.<br /></li>
<li>You needn't have verified the legal status of us.<br /></li>
</ul>
<p>
be born to sb.: 为某人所生<br />
</p>
<ul class="org-ul">
<li>These children born to slaves shouldn't secure the right to the lands.<br /></li>
<li>The child born to my first wife follows in my footsteps eventually.<br /></li>
<li>The first child born to me will secure the right to the country.<br /></li>
</ul>
<p>
a quarter of sth.: 四分之一<br />
</p>
<ul class="org-ul">
<li>A quarter of your lymph nodes may have been destroyed.<br /></li>
<li>A quarter of the course has already been completed.<br /></li>
<li>A quarter of his scabs have been wiped away by this doctor.<br /></li>
</ul>
<p>
the link between sth.(pl): 某事的联系<br />
</p>
<ul class="org-ul">
<li>The link between health and sleep means that we must sleep at least 7 hours a day.<br /></li>
<li>The link between health and smoking means that I must give up smoking right now.<br /></li>
<li>The link between health and sports means that I need to exercise every day.<br /></li>
</ul>
<p>
in practice: 实际上<br />
</p>
<ul class="org-ul">
<li>The chance of hitting the surface of the desk approaches zero in practice.<br /></li>
<li>I can't speak to a native English speaker in China in practice.<br /></li>
<li>These parts can't be pieced together in practice.<br /></li>
</ul>
<p>
the tables were turned: 形势逆转了<br />
</p>
<ul class="org-ul">
<li>He used to quarrel bitterly with his wife, and the tables were turned.<br /></li>
<li>The tables may have already been turned.<br /></li>
<li>I bet the tables were turned.<br /></li>
</ul>
<p>
have relationships with sb.: 与某人有关系<br />
</p>
<ul class="org-ul">
<li>You shouldn't have relationships with two men at the same time.<br /></li>
<li>She had a relationship with the man who committed a murder.<br /></li>
<li>She is eager to have relationships with the guy who works for Apple.<br /></li>
</ul>
<p>
in public ceremonies: 在公共仪式上<br />
</p>
<ul class="org-ul">
<li>Speaking in public ceremonies, I quaked in every limb and my soul<br /></li>
<li>I focused on dresses in public ceremonies rather than those pretty girls.<br /></li>
<li>The vicar assembled those parts into a well-organized machine in public ceremonies.<br /></li>
</ul>
<p>
at stake: 利害攸关<br />
</p>
<ul class="org-ul">
<li>We must pay attention to those facts at stake.<br /></li>
<li>Marriage is bonded to the wealth of their families at stake.<br /></li>
<li>Those people at stake will be bunched up together at the meeting.<br /></li>
</ul>
<p>
became independent from sb./sth.: 独立于<br />
</p>
<ul class="org-ul">
<li>With the team flying apart, those players became independent from this club.<br /></li>
<li>It doesn't help anyone, since you became independent from our family.<br /></li>
<li>As you still receive money from your mother, you don't become independent from your family.<br /></li>
</ul>
<p>
be encouraged by: 被&#x2026;鼓励<br />
</p>
<ul class="org-ul">
<li>The worker was encouraged by his boss to undertake the task in harsher working conditions.<br /></li>
<li>Encouraged by his wife, the baker managed to set up a factory.<br /></li>
<li>While he decided to give up, he was encouraged by those assembly instructions.<br /></li>
</ul>
<p>
focus on A rather than B: 聚集于A而不是B<br />
</p>
<ul class="org-ul">
<li>We focused on the lymph nodes rather than these scabs.<br /></li>
<li>He focused on those pretty girls rather than money.<br /></li>
<li>I focused on these antique shops rather than those street signs.<br /></li>
</ul>
<p>
ease restrictions on sth.: 放松对某事的限制<br />
</p>
<ul class="org-ul">
<li>It became an accepted fact that the authorities eased restrictions on sex before marriage.<br /></li>
<li>After easing restrictions on his watching TV, I went to work.<br /></li>
<li>While easing restrictions on vaccination,<br />
the authorities established a law prohibiting same-sex marriages.<br /></li>
</ul>
<p>
be shaped by sth.: 受&#x2026;影响<br />
</p>
<ul class="org-ul">
<li>The statue must have been shaped by the wind and rain.<br /></li>
<li>The statue must be shaped by the wind and rain.<br /></li>
<li>The statue may be shaped by the wind and rain.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
